### Definição de DataFrame: é um objeto bi-dimensional que contém dados em forma tabular. Ou seja, é como se fosse uma tabela do Excel, que é possível adicionar linhas e colunas!

In [4]:
import pandas as pd

### Criando DataFrames

In [5]:
df1 = pd.DataFrame()

In [3]:
df1

Empty DataFrame
Columns: []
Index: []

In [4]:
type(df1)

pandas.core.frame.DataFrame

In [5]:
# Olha só como foi importante aprender sobre dicionários!

dict1 = {'identificacao': [1, 2, 3, 4, 5], 
         'nome': ['Caio', 'Rodrigo', 'Rafael', 'Mariane', 'Nathane']}

In [6]:
dict1

{'identificacao': [1, 2, 3, 4, 5],
 'nome': ['Caio', 'Rodrigo', 'Rafael', 'Mariane', 'Nathane']}

In [7]:
df2 = pd.DataFrame(data = dict1)

In [8]:
df2

   identificacao     nome
0              1     Caio
1              2  Rodrigo
2              3   Rafael
3              4  Mariane
4              5  Nathane

In [9]:
df3 = pd.DataFrame(data = dict1, index = [29, 1, 0, 2222, 88])

In [10]:
df3

      identificacao     nome
29                1     Caio
1                 2  Rodrigo
0                 3   Rafael
2222              4  Mariane
88                5  Nathane

In [11]:
# SERIE É DO PANDAS, AJUDA A CONSTRUI DATAFRAME
serie1 = pd.Series([1, 2, 3])

In [12]:
serie1

0    1
1    2
2    3
dtype: int64

In [13]:
type(serie1)

pandas.core.series.Series

In [14]:
serie2 = pd.Series(['a', 'b', 'c'])

In [15]:
df4 = pd.DataFrame({'coluna1': serie1, 
                    'coluna2': serie2})

In [16]:
df4

   coluna1 coluna2
0        1       a
1        2       b
2        3       c

In [1]:
import numpy as np

In [2]:
array1 = np.array([[1, 2, 3], 
                   ['São Paulo', 'Rio de Janeiro', 'Campinas'], 
                   ['SP', 'RJ', 'SP']])

In [19]:
array1

array([['1', '2', '3'],
       ['São Paulo', 'Rio de Janeiro', 'Campinas'],
       ['SP', 'RJ', 'SP']], dtype='<U14')

In [20]:
type(array1)

numpy.ndarray

In [21]:
df5 = pd.DataFrame(data = array1.transpose(), 
                   index = ['linha1', 'linha2', 'linha3'], 
                   columns = ['identificacao', 'cidade', 'estado'])

In [22]:
df5

       identificacao          cidade estado
linha1             1       São Paulo     SP
linha2             2  Rio de Janeiro     RJ
linha3             3        Campinas     SP

In [9]:
matriz1 = np.matrix([[1, 2, 3], 
                     ['São Paulo', 'Rio de Janeiro', 'Campinas'], 
                     ['SP', 'RJ', 'SP']])

In [10]:
type(matriz1)

numpy.matrix

In [11]:
df6 = pd.DataFrame(data = matriz1.transpose(), 
                   index = ['linha1', 'linha2', 'linha3'], 
                   columns = ['identificacao', 'cidade', 'estado'])

In [12]:
df6

       identificacao          cidade estado
linha1             1       São Paulo     SP
linha2             2  Rio de Janeiro     RJ
linha3             3        Campinas     SP

### Selecionando DataFrames

In [28]:
df3

      identificacao     nome
29                1     Caio
1                 2  Rodrigo
0                 3   Rafael
2222              4  Mariane
88                5  Nathane

In [29]:
df3['identificacao_mais_5'] = df3['identificacao'] + 5

In [30]:
df3

      identificacao     nome  identificacao_mais_5
29                1     Caio                     6
1                 2  Rodrigo                     7
0                 3   Rafael                     8
2222              4  Mariane                     9
88                5  Nathane                    10

In [31]:
# CRIANDO UMAA COLUNA QUE SE CHAMA INDEX
df3['index'] = 0

In [32]:
df3

      identificacao     nome  identificacao_mais_5  index
29                1     Caio                     6      0
1                 2  Rodrigo                     7      0
0                 3   Rafael                     8      0
2222              4  Mariane                     9      0
88                5  Nathane                    10      0

In [33]:
# RENOEMANDO O INDEX REAL DO DATAFRAME
df3.index = [29, 0, 1, 2222, 88]

In [34]:
df3

      identificacao     nome  identificacao_mais_5  index
29                1     Caio                     6      0
0                 2  Rodrigo                     7      0
1                 3   Rafael                     8      0
2222              4  Mariane                     9      0
88                5  Nathane                    10      0

In [37]:
df3['nome']

29         Caio
0       Rodrigo
1        Rafael
2222    Mariane
88      Nathane
Name: nome, dtype: object

In [38]:
df3.nome

29         Caio
0       Rodrigo
1        Rafael
2222    Mariane
88      Nathane
Name: nome, dtype: object

In [39]:
df3['index']

29      0
0       0
1       0
2222    0
88      0
Name: index, dtype: int64

In [40]:
df3.index

Int64Index([29, 0, 1, 2222, 88], dtype='int64')

In [41]:
df3

      identificacao     nome  identificacao_mais_5  index
29                1     Caio                     6      0
0                 2  Rodrigo                     7      0
1                 3   Rafael                     8      0
2222              4  Mariane                     9      0
88                5  Nathane                    10      0

In [42]:
df3[['nome', 'index']]

         nome  index
29       Caio      0
0     Rodrigo      0
1      Rafael      0
2222  Mariane      0
88    Nathane      0

In [43]:
df3

      identificacao     nome  identificacao_mais_5  index
29                1     Caio                     6      0
0                 2  Rodrigo                     7      0
1                 3   Rafael                     8      0
2222              4  Mariane                     9      0
88                5  Nathane                    10      0

In [44]:
# TRAZES DO DATA FRAME A COLUNA IDENTIFICACOA 

df3[df3.identificacao % 2 == 0]

      identificacao     nome  identificacao_mais_5  index
0                 2  Rodrigo                     7      0
2222              4  Mariane                     9      0

In [45]:
# TRAZER DO DA COLUNA NOME QUE É UMA STRING E CONTEM A 'R'

df3[df3.nome.str.contains('R')]

   identificacao     nome  identificacao_mais_5  index
0              2  Rodrigo                     7      0
1              3   Rafael                     8      0

In [46]:
#TRAZER DO DATAFRAME DA COLUNA NOME QUE É UMA STRING E CONTEM A LENTRA'R' E ONDE A IDENTIFICACAO POSSUI O VALOR 3

df3[(df3.nome.str.contains('R')) & (df3.identificacao == 3)]

   identificacao    nome  identificacao_mais_5  index
1              3  Rafael                     8      0

In [47]:
# TRAZER DO DATAFRAME DA COLUNA NOME QUE É UMA STRING E CONTEM A LENTRA'R' OU ONDE A IDENTIFICACAO POSSUI O VALOR 5

df3[(df3.nome.str.contains('R')) | (df3.identificacao == 5)]

    identificacao     nome  identificacao_mais_5  index
0               2  Rodrigo                     7      0
1               3   Rafael                     8      0
88              5  Nathane                    10      0

- loc: localizar pelo NOME dos índices ou colunas
- iloc: localizar pela POSIÇÃO dos índices ou colunas

In [48]:
df3

      identificacao     nome  identificacao_mais_5  index
29                1     Caio                     6      0
0                 2  Rodrigo                     7      0
1                 3   Rafael                     8      0
2222              4  Mariane                     9      0
88                5  Nathane                    10      0

In [49]:
df3.loc[0]

identificacao                 2
nome                    Rodrigo
identificacao_mais_5          7
index                         0
Name: 0, dtype: object

In [50]:
df3.iloc[0]

identificacao              1
nome                    Caio
identificacao_mais_5       6
index                      0
Name: 29, dtype: object

In [51]:
df3.loc[0:1]

   identificacao     nome  identificacao_mais_5  index
0              2  Rodrigo                     7      0
1              3   Rafael                     8      0

In [52]:
df3.iloc[0:1]

    identificacao  nome  identificacao_mais_5  index
29              1  Caio                     6      0

In [53]:
df3.iloc[0:2]

    identificacao     nome  identificacao_mais_5  index
29              1     Caio                     6      0
0               2  Rodrigo                     7      0

In [54]:
df3

      identificacao     nome  identificacao_mais_5  index
29                1     Caio                     6      0
0                 2  Rodrigo                     7      0
1                 3   Rafael                     8      0
2222              4  Mariane                     9      0
88                5  Nathane                    10      0

In [55]:
df3.loc[88:1:-1]

      identificacao     nome  identificacao_mais_5  index
88                5  Nathane                    10      0
2222              4  Mariane                     9      0
1                 3   Rafael                     8      0

In [56]:
df3.loc[88:1:-2]

    identificacao     nome  identificacao_mais_5  index
88              5  Nathane                    10      0
1               3   Rafael                     8      0

In [57]:
df3

      identificacao     nome  identificacao_mais_5  index
29                1     Caio                     6      0
0                 2  Rodrigo                     7      0
1                 3   Rafael                     8      0
2222              4  Mariane                     9      0
88                5  Nathane                    10      0

In [58]:
df3.loc[:, 'nome']

29         Caio
0       Rodrigo
1        Rafael
2222    Mariane
88      Nathane
Name: nome, dtype: object

In [59]:
df3.iloc[:, 1]

29         Caio
0       Rodrigo
1        Rafael
2222    Mariane
88      Nathane
Name: nome, dtype: object

In [60]:
df3.loc[2222, 'nome']

'Mariane'

In [61]:
df3.iloc[3, 1]

'Mariane'

In [62]:
df3.loc[2222, 'nome'] = 'Jeremias'

In [63]:
df3

      identificacao      nome  identificacao_mais_5  index
29                1      Caio                     6      0
0                 2   Rodrigo                     7      0
1                 3    Rafael                     8      0
2222              4  Jeremias                     9      0
88                5   Nathane                    10      0

In [64]:
df3.iloc[-1]

identificacao                 5
nome                    Nathane
identificacao_mais_5         10
index                         0
Name: 88, dtype: object

In [65]:
df3.iloc[-1, -2]

10

In [66]:
df3.loc[-1]

KeyError: -1

In [67]:
df3

      identificacao      nome  identificacao_mais_5  index
29                1      Caio                     6      0
0                 2   Rodrigo                     7      0
1                 3    Rafael                     8      0
2222              4  Jeremias                     9      0
88                5   Nathane                    10      0

In [68]:
df3.loc[[0, 2222]]

      identificacao      nome  identificacao_mais_5  index
0                 2   Rodrigo                     7      0
2222              4  Jeremias                     9      0

In [69]:
df3.iloc[[1, 3]]

      identificacao      nome  identificacao_mais_5  index
0                 2   Rodrigo                     7      0
2222              4  Jeremias                     9      0

### Atributos de DataFrames

In [70]:
df3

      identificacao      nome  identificacao_mais_5  index
29                1      Caio                     6      0
0                 2   Rodrigo                     7      0
1                 3    Rafael                     8      0
2222              4  Jeremias                     9      0
88                5   Nathane                    10      0

In [71]:
df3.dtypes

identificacao            int64
nome                    object
identificacao_mais_5     int64
index                    int64
dtype: object

In [72]:
# TRANFORMOU EM UMA STRING A COLUNA IDENTICACAO

df3.identificacao = df3.identificacao.astype(str)

In [73]:
df3.dtypes

identificacao           object
nome                    object
identificacao_mais_5     int64
index                    int64
dtype: object

In [74]:
df3

     identificacao      nome  identificacao_mais_5  index
29               1      Caio                     6      0
0                2   Rodrigo                     7      0
1                3    Rafael                     8      0
2222             4  Jeremias                     9      0
88               5   Nathane                    10      0

In [75]:
df3['teste1'] = [None, 2, 4, None, 10]

In [76]:
df3

     identificacao      nome  identificacao_mais_5  index  teste1
29               1      Caio                     6      0     NaN
0                2   Rodrigo                     7      0     2.0
1                3    Rafael                     8      0     4.0
2222             4  Jeremias                     9      0     NaN
88               5   Nathane                    10      0    10.0

In [78]:
df3.dtypes

identificacao            object
nome                     object
identificacao_mais_5      int64
index                     int64
teste1                  float64
dtype: object

In [79]:
# CONSULTAR OS NOMES DAS COLUNAS

df3.columns

Index(['identificacao', 'nome', 'identificacao_mais_5', 'index', 'teste1'], dtype='object')

In [80]:
# RENOMEANDO OS NOMES DAS COLUNAS

df3.columns = ['identificacao', 'nome', 'identificacao_mais_5', 'index_MODIFICADO', 'teste1']

In [81]:
df3

     identificacao      nome  identificacao_mais_5  index_MODIFICADO  teste1
29               1      Caio                     6                 0     NaN
0                2   Rodrigo                     7                 0     2.0
1                3    Rafael                     8                 0     4.0
2222             4  Jeremias                     9                 0     NaN
88               5   Nathane                    10                 0    10.0

In [82]:
# TRAS A CONTAGEM DE LINHA E COLUNAS

df3.index

Int64Index([29, 0, 1, 2222, 88], dtype='int64')

In [83]:
df3.shape

(5, 5)

In [84]:
# TRAAZ OS VALORES

df3.values

array([['1', 'Caio', 6, 0, nan],
       ['2', 'Rodrigo', 7, 0, 2.0],
       ['3', 'Rafael', 8, 0, 4.0],
       ['4', 'Jeremias', 9, 0, nan],
       ['5', 'Nathane', 10, 0, 10.0]], dtype=object)

### Métodos I

#### combine_first

In [85]:
df3

     identificacao      nome  identificacao_mais_5  index_MODIFICADO  teste1
29               1      Caio                     6                 0     NaN
0                2   Rodrigo                     7                 0     2.0
1                3    Rafael                     8                 0     4.0
2222             4  Jeremias                     9                 0     NaN
88               5   Nathane                    10                 0    10.0

In [86]:
df3.teste1.combine_first(df3['identificacao_mais_5'])

29       6.0
0        2.0
1        4.0
2222     9.0
88      10.0
Name: teste1, dtype: float64

#### copy

In [87]:
df1000 = df3.copy()

In [88]:
df1000

     identificacao      nome  identificacao_mais_5  index_MODIFICADO  teste1
29               1      Caio                     6                 0     NaN
0                2   Rodrigo                     7                 0     2.0
1                3    Rafael                     8                 0     4.0
2222             4  Jeremias                     9                 0     NaN
88               5   Nathane                    10                 0    10.0

#### count

In [89]:
df1000.count()

identificacao           5
nome                    5
identificacao_mais_5    5
index_MODIFICADO        5
teste1                  3
dtype: int64

#### drop

In [90]:
df3

     identificacao      nome  identificacao_mais_5  index_MODIFICADO  teste1
29               1      Caio                     6                 0     NaN
0                2   Rodrigo                     7                 0     2.0
1                3    Rafael                     8                 0     4.0
2222             4  Jeremias                     9                 0     NaN
88               5   Nathane                    10                 0    10.0

In [1]:
# APAGANDO UMA COLUNA, PRECISA INFORMAR SE É COLUMNS OU INDEX

df3.drop(columns = ['index_MODIFICADO'])

NameError: name 'df3' is not defined

In [92]:
df3

     identificacao      nome  identificacao_mais_5  index_MODIFICADO  teste1
29               1      Caio                     6                 0     NaN
0                2   Rodrigo                     7                 0     2.0
1                3    Rafael                     8                 0     4.0
2222             4  Jeremias                     9                 0     NaN
88               5   Nathane                    10                 0    10.0

In [ ]:
df3 = df3.drop(columns = ['index_MODIFICADO'])

In [93]:
df3.drop(columns = ['index_MODIFICADO'], inplace=True)

In [94]:
df3

     identificacao      nome  identificacao_mais_5  teste1
29               1      Caio                     6     NaN
0                2   Rodrigo                     7     2.0
1                3    Rafael                     8     4.0
2222             4  Jeremias                     9     NaN
88               5   Nathane                    10    10.0

In [95]:
df3.drop(index = [88], inplace=True)

In [96]:
df3

     identificacao      nome  identificacao_mais_5  teste1
29               1      Caio                     6     NaN
0                2   Rodrigo                     7     2.0
1                3    Rafael                     8     4.0
2222             4  Jeremias                     9     NaN

#### drop_duplicates

In [97]:
# JUNTANDO DATAFRAME

df7 = pd.concat([df1000, df1000])

In [98]:
df7

     identificacao      nome  identificacao_mais_5  index_MODIFICADO  teste1
29               1      Caio                     6                 0     NaN
0                2   Rodrigo                     7                 0     2.0
1                3    Rafael                     8                 0     4.0
2222             4  Jeremias                     9                 0     NaN
88               5   Nathane                    10                 0    10.0
29               1      Caio                     6                 0     NaN
0                2   Rodrigo                     7                 0     2.0
1                3    Rafael                     8                 0     4.0
2222             4  Jeremias                     9                 0     NaN
88               5   Nathane                    10                 0    10.0

In [99]:
df7.drop_duplicates(inplace=True)

In [100]:
df7

     identificacao      nome  identificacao_mais_5  index_MODIFICADO  teste1
29               1      Caio                     6                 0     NaN
0                2   Rodrigo                     7                 0     2.0
1                3    Rafael                     8                 0     4.0
2222             4  Jeremias                     9                 0     NaN
88               5   Nathane                    10                 0    10.0

#### dropna

In [101]:
df8 = df7.copy()

In [102]:
df8

     identificacao      nome  identificacao_mais_5  index_MODIFICADO  teste1
29               1      Caio                     6                 0     NaN
0                2   Rodrigo                     7                 0     2.0
1                3    Rafael                     8                 0     4.0
2222             4  Jeremias                     9                 0     NaN
88               5   Nathane                    10                 0    10.0

In [103]:
# ELE TRAZ APENAS AS LINHAS ONDE NAO TEM VALORES NULOS

df8.dropna(inplace=True)

In [104]:
df8

   identificacao     nome  identificacao_mais_5  index_MODIFICADO  teste1
0              2  Rodrigo                     7                 0     2.0
1              3   Rafael                     8                 0     4.0
88             5  Nathane                    10                 0    10.0

#### fillna

In [105]:
df7

     identificacao      nome  identificacao_mais_5  index_MODIFICADO  teste1
29               1      Caio                     6                 0     NaN
0                2   Rodrigo                     7                 0     2.0
1                3    Rafael                     8                 0     4.0
2222             4  Jeremias                     9                 0     NaN
88               5   Nathane                    10                 0    10.0

In [106]:
# AQUI SUBSTITUI OS VALORES NULOS E COLOCA A INFORMAACAO DESEJAVEL

df7.fillna('NULO', inplace=True)

In [107]:
df7

     identificacao      nome  identificacao_mais_5  index_MODIFICADO teste1
29               1      Caio                     6                 0   NULO
0                2   Rodrigo                     7                 0      2
1                3    Rafael                     8                 0      4
2222             4  Jeremias                     9                 0   NULO
88               5   Nathane                    10                 0     10

#### head

In [108]:
# TRAZ AS 2 PRIMEIRAS LINHAS
df7.head(2)

   identificacao     nome  identificacao_mais_5  index_MODIFICADO teste1
29             1     Caio                     6                 0   NULO
0              2  Rodrigo                     7                 0      2

#### tail

In [109]:
# TRAZ AS ULTIMAS DUAS LINHAS

df7.tail(2)

     identificacao      nome  identificacao_mais_5  index_MODIFICADO teste1
2222             4  Jeremias                     9                 0   NULO
88               5   Nathane                    10                 0     10

#### groupby

In [111]:
df10 = pd.concat([df1000, df1000])

In [112]:
df10

     identificacao      nome  identificacao_mais_5  index_MODIFICADO  teste1
29               1      Caio                     6                 0     NaN
0                2   Rodrigo                     7                 0     2.0
1                3    Rafael                     8                 0     4.0
2222             4  Jeremias                     9                 0     NaN
88               5   Nathane                    10                 0    10.0
29               1      Caio                     6                 0     NaN
0                2   Rodrigo                     7                 0     2.0
1                3    Rafael                     8                 0     4.0
2222             4  Jeremias                     9                 0     NaN
88               5   Nathane                    10                 0    10.0

In [113]:
df10.groupby(['nome']).identificacao_mais_5.sum()

nome
Caio        12
Jeremias    18
Nathane     20
Rafael      16
Rodrigo     14
Name: identificacao_mais_5, dtype: int64

SELECT
    nome,
    sum(identificacao_mais_5)
from df10
group by nome

### Módulos II

In [114]:
df3

     identificacao      nome  identificacao_mais_5  teste1
29               1      Caio                     6     NaN
0                2   Rodrigo                     7     2.0
1                3    Rafael                     8     4.0
2222             4  Jeremias                     9     NaN

#### isin

In [115]:
# MOSTRA TRUE SE POSSUI OS VAALORES QUE FOI PASSADO NO ()
df3.isin([2, 4])

      identificacao   nome  identificacao_mais_5  teste1
29            False  False                 False   False
0             False  False                 False    True
1             False  False                 False    True
2222          False  False                 False   False

In [116]:
df3.isin(['2', '4'])

      identificacao   nome  identificacao_mais_5  teste1
29            False  False                 False   False
0              True  False                 False   False
1             False  False                 False   False
2222           True  False                 False   False

In [117]:
df3[df3.isin(['2', '4']) == True]

     identificacao nome  identificacao_mais_5  teste1
29             NaN  NaN                   NaN     NaN
0                2  NaN                   NaN     NaN
1              NaN  NaN                   NaN     NaN
2222             4  NaN                   NaN     NaN

In [118]:
# RETORNA OS VALORES QUE DENTRO DA IDENTIFICAO FOR TRUE


df3[df3.identificacao.isin(['2', '4']) == True]

     identificacao      nome  identificacao_mais_5  teste1
0                2   Rodrigo                     7     2.0
2222             4  Jeremias                     9     NaN

In [120]:
df3[df3.teste1.isin([2, 4]) == True]

  identificacao     nome  identificacao_mais_5  teste1
0             2  Rodrigo                     7     2.0
1             3   Rafael                     8     4.0

#### operacoes

In [121]:
df3

     identificacao      nome  identificacao_mais_5  teste1
29               1      Caio                     6     NaN
0                2   Rodrigo                     7     2.0
1                3    Rafael                     8     4.0
2222             4  Jeremias                     9     NaN

In [122]:
df3.identificacao_mais_5.min()

6

In [123]:
df3.identificacao_mais_5.max()

9

In [124]:
df3.identificacao_mais_5.mean()

7.5

In [125]:
df3.identificacao_mais_5.median()

7.5

In [126]:
df3.identificacao_mais_5.sum()

30

In [127]:
df3.identificacao.sum()

'1234'

In [128]:
df3.identificacao_mais_5.std()

1.2909944487358056

#### notnull

In [129]:
df3

     identificacao      nome  identificacao_mais_5  teste1
29               1      Caio                     6     NaN
0                2   Rodrigo                     7     2.0
1                3    Rafael                     8     4.0
2222             4  Jeremias                     9     NaN

In [130]:
df3.teste1.notnull()

29      False
0        True
1        True
2222    False
Name: teste1, dtype: bool

In [131]:
df3[df3.teste1.notnull() == True]

  identificacao     nome  identificacao_mais_5  teste1
0             2  Rodrigo                     7     2.0
1             3   Rafael                     8     4.0

#### rename

In [132]:
df3

     identificacao      nome  identificacao_mais_5  teste1
29               1      Caio                     6     NaN
0                2   Rodrigo                     7     2.0
1                3    Rafael                     8     4.0
2222             4  Jeremias                     9     NaN

In [133]:
# RENOEMANDO NOME DA COLUNA

df3.rename(columns={'nome': 'Nome'}, inplace=True)

In [134]:
df3

     identificacao      Nome  identificacao_mais_5  teste1
29               1      Caio                     6     NaN
0                2   Rodrigo                     7     2.0
1                3    Rafael                     8     4.0
2222             4  Jeremias                     9     NaN

In [135]:
df3.rename(index={2222: -1}, inplace=True)

In [136]:
df3

    identificacao      Nome  identificacao_mais_5  teste1
 29             1      Caio                     6     NaN
 0              2   Rodrigo                     7     2.0
 1              3    Rafael                     8     4.0
-1              4  Jeremias                     9     NaN

#### replace

In [137]:
df3

    identificacao      Nome  identificacao_mais_5  teste1
 29             1      Caio                     6     NaN
 0              2   Rodrigo                     7     2.0
 1              3    Rafael                     8     4.0
-1              4  Jeremias                     9     NaN

In [138]:
#  MUDANDO O VALAOR DA LINHA NOMES

df3.Nome.replace('Jeremias', 'Mariane', inplace=True)

In [139]:
df3

    identificacao     Nome  identificacao_mais_5  teste1
 29             1     Caio                     6     NaN
 0              2  Rodrigo                     7     2.0
 1              3   Rafael                     8     4.0
-1              4  Mariane                     9     NaN

#### round

In [141]:
df3['teste2'] = [1.2, 3.6451, 2.98018, 9.13]

In [142]:
df3

    identificacao     Nome  identificacao_mais_5  teste1   teste2
 29             1     Caio                     6     NaN  1.20000
 0              2  Rodrigo                     7     2.0  3.64510
 1              3   Rafael                     8     4.0  2.98018
-1              4  Mariane                     9     NaN  9.13000

In [143]:
df3.teste2.round(0)

 29    1.0
 0     4.0
 1     3.0
-1     9.0
Name: teste2, dtype: float64

In [146]:
df3.teste2.round(1)

 29    1.2
 0     3.6
 1     3.0
-1     9.1
Name: teste2, dtype: float64

In [147]:
df3.teste2 = df3.teste2.round(1)

In [148]:
df3

    identificacao     Nome  identificacao_mais_5  teste1  teste2
 29             1     Caio                     6     NaN     1.2
 0              2  Rodrigo                     7     2.0     3.6
 1              3   Rafael                     8     4.0     3.0
-1              4  Mariane                     9     NaN     9.1

#### to_clipboard

In [149]:
# SERVE PARA EXPORTAR E MANDAR PARA O EXCEL

df3.to_clipboard()

In [150]:
df3.to_clipboard(index=False)